In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({ 'key1': ['a','a','b','b','a'],
                    'key2': ['one','two','one','two','one'],
                    'data1': np.random.randn(5),
                    'data2': np.random.randn(5)})

In [3]:
df

      data1     data2 key1 key2
0 -0.314385  0.468169    a  one
1 -0.221632 -1.602863    a  two
2  0.508753  0.481774    b  one
3 -0.680102 -0.941625    b  two
4  0.616861  0.945406    a  one

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.026948
b   -0.085674
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.151238
      two    -0.221632
b     one     0.508753
      two    -0.680102
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a     0.151238 -0.221632
b     0.508753 -0.680102

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.026948 -0.063096
b    -0.085674 -0.229925

In [14]:
df.groupby('key1').count()

      data1  data2  key2
key1
a         3      3     3
b         2      2     2

In [15]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.151238  0.706787
     two  -0.221632 -1.602863
b    one   0.508753  0.481774
     two  -0.680102 -0.941625

In [16]:
df.groupby(['key1','key2']).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [18]:
df.groupby(['key1','key2'])['data2'].mean()

key1  key2
a     one     0.706787
      two    -1.602863
b     one     0.481774
      two    -0.941625
Name: data2, dtype: float64

In [19]:
df.groupby('key1')

In [20]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.314385  0.468169    a  one
1 -0.221632 -1.602863    a  two
4  0.616861  0.945406    a  one
b
      data1     data2 key1 key2
2  0.508753  0.481774    b  one
3 -0.680102 -0.941625    b  two

In [21]:
for (k1, k2), group in df.groupby(['key1','key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.314385  0.468169    a  one
4  0.616861  0.945406    a  one
a two
      data1     data2 key1 key2
1 -0.221632 -1.602863    a  two
b one
      data1     data2 key1 key2
2  0.508753  0.481774    b  one
b two
      data1     data2 key1 key2
3 -0.680102 -0.941625    b  two

In [22]:
pieces = dict(list(df.groupby('key1')))

In [23]:
pieces

{'a':       data1     data2 key1 key2
 0 -0.314385  0.468169    a  one
 1 -0.221632 -1.602863    a  two
 4  0.616861  0.945406    a  one, 'b':       data1     data2 key1 key2
 2  0.508753  0.481774    b  one
 3 -0.680102 -0.941625    b  two}

In [24]:
pieces['b']

      data1     data2 key1 key2
2  0.508753  0.481774    b  one
3 -0.680102 -0.941625    b  two

In [25]:
df2 = pd.DataFrame(np.random.randn(5,5), 
                   columns=['a','b','c','d','e'],
                   index=['Joe','Steve','Wes','Jim','Travis'])

In [26]:
df2

               a         b         c         d         e
Joe    -0.832856  1.017320 -0.579841 -1.661825  0.283377
Steve  -0.297381  1.566033  0.614451  0.142037 -0.118081
Wes     0.855372  0.832672 -1.656333  0.038637 -0.423750
Jim     0.041632 -0.527659  0.270584 -1.225269  1.410121
Travis  0.613147 -0.608726 -0.228491 -0.624873  1.077127

In [27]:
map_dict = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [28]:
df2.groupby(map_dict, axis=1).sum()

            blue       red
Joe    -2.241666  0.467840
Steve   0.756488  1.150571
Wes    -1.617695  1.264294
Jim    -0.954685  0.924094
Travis -0.853364  1.081548

In [29]:
map_s = pd.Series(map_dict)

In [30]:
map_s

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [31]:
df2.groupby(map_s, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [32]:
df

      data1     data2 key1 key2
0 -0.314385  0.468169    a  one
1 -0.221632 -1.602863    a  two
2  0.508753  0.481774    b  one
3 -0.680102 -0.941625    b  two
4  0.616861  0.945406    a  one

In [33]:
grouped = df.groupby('key1')

In [34]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [35]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.931246  2.548269
b     1.188856  1.423398

In [36]:
grouped.agg('std')

         data1     data2
key1
a     0.512980  1.354659
b     0.840648  1.006494

In [37]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.026948  0.512980 -0.314385 -0.268009 -0.221632  0.197614
b      2.0 -0.085674  0.840648 -0.680102 -0.382888 -0.085674  0.211539

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.616861   3.0 -0.063096  1.354659 -1.602863 -0.567347  0.468169
b     0.508753   2.0 -0.229925  1.006494 -0.941625 -0.585775 -0.229925


           75%       max
key1
a     0.706787  0.945406
b     0.125924  0.481774

In [38]:
grouped.describe().stack()

               data1     data2
key1
a    count  3.000000  3.000000
     mean   0.026948 -0.063096
     std    0.512980  1.354659
     min   -0.314385 -1.602863
     25%   -0.268009 -0.567347
     50%   -0.221632  0.468169
     75%    0.197614  0.706787
     max    0.616861  0.945406
b    count  2.000000  2.000000
     mean  -0.085674 -0.229925
     std    0.840648  1.006494
     min   -0.680102 -0.941625
     25%   -0.382888 -0.585775
     50%   -0.085674 -0.229925
     75%    0.211539  0.125924
     max    0.508753  0.481774